## Plan Result (sandbox-enterprise)




<pre><code>Plan: 25 to add, 7 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_key_vault_secret.sp_token
* Update
  * module.acme[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_windows_function_app.funcapp
  * module.acme[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_windows_function_app.funcapp
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azuread_group.groups[&#34;Contributor&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.acme["DTS-Terraform-Dev-Test3"].azurerm_windows_function_app.funcapp will be updated in-place
  ~ resource "azurerm_windows_function_app" "funcapp" {
      ~ app_settings                      = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"             = (sensitive)
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"      = (sensitive)
          + "AzureWebJobsStorage"                        = (sensitive)
            # (10 unchanged elements hidden)
        }
        id                                = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/enterprise-dev-rg/providers/Microsoft.Web/sites/acmedtsterraformdevtest3"
        name                              = "acmedtsterraformdevtest3"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (25 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string = (sensitive value)
          - application_insights_key               = (sensitive value)
            # (23 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.acme["DTS-Terraform-Dev-Test4"].azurerm_windows_function_app.funcapp will be updated in-place
  ~ resource "azurerm_windows_function_app" "funcapp" {
      ~ app_settings                      = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"             = (sensitive)
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"      = (sensitive)
          + "AzureWebJobsStorage"                        = (sensitive)
            # (10 unchanged elements hidden)
        }
        id                                = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/enterprise-dev-rg/providers/Microsoft.Web/sites/acmedtsterraformdevtest4"
        name                              = "acmedtsterraformdevtest4"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (25 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string = (sensitive value)
          - application_insights_key               = (sensitive value)
            # (23 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
        id                         = "50b70fc9-77a5-4f66-8e93-64a3a554bf67"
      ~ members                    = [
          + "1c81de61-e810-47e5-b2fe-30c6ae0dedfd",
            # (2 unchanged elements hidden)
        ]
        # (18 unchanged attributes hidden)
    }

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c06069648ed8e38bckv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c06069648ed8e38bckv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c06069648ed8e38bckv"
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c06069648ed8e38bckv"
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c06069648ed8e38bckv"
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-RBAC-SBOX"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
        id                         = "9dcfd92a-2e3a-48ed-b985-81d33df9b465"
      ~ members                    = [
          + "1c81de61-e810-47e5-b2fe-30c6ae0dedfd",
            # (2 unchanged elements hidden)
        ]
        # (18 unchanged attributes hidden)
    }

  # module.subscription["DTS-RBAC-SBOX"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/cefd1f81277156ff9kv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-RBAC-SBOX"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/cefd1f81277156ff9kv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-RBAC-SBOX"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/cefd1f81277156ff9kv"
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-RBAC-SBOX"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/cefd1f81277156ff9kv"
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-RBAC-SBOX"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/cefd1f81277156ff9kv"
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
        id                         = "76af4881-223c-4978-b3d6-b8eda9d2f83d"
      ~ members                    = [
          + "1c81de61-e810-47e5-b2fe-30c6ae0dedfd",
            # (2 unchanged elements hidden)
        ]
        # (18 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c6d1e076a3e28a488kv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c6d1e076a3e28a488kv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c6d1e076a3e28a488kv"
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c6d1e076a3e28a488kv"
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c6d1e076a3e28a488kv"
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
        id                         = "9b4fb1ef-efe3-4954-b2ab-73a1fa1850d2"
      ~ members                    = [
          + "1c81de61-e810-47e5-b2fe-30c6ae0dedfd",
            # (2 unchanged elements hidden)
        ]
        # (18 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c173a0e96abc83ab0kv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c173a0e96abc83ab0kv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c173a0e96abc83ab0kv"
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c173a0e96abc83ab0kv"
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c173a0e96abc83ab0kv"
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
        id                         = "38d93cb5-0dc6-4436-b2ad-caedd3baf247"
      ~ members                    = [
          + "1c81de61-e810-47e5-b2fe-30c6ae0dedfd",
            # (2 unchanged elements hidden)
        ]
        # (18 unchanged attributes hidden)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405b539e8b3kv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405b539e8b3kv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405b539e8b3kv"
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405b539e8b3kv"
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/55922b0d-5c33-467f-91b9-42c4059d310c/resourceGroups/azure-control-prod-rg/providers/Microsoft.KeyVault/vaults/cbb9ca405b539e8b3kv"
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 25 to add, 7 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":29,"Program":"tfcmt","SHA1":"","Target":"sandbox-enterprise","Vars":{}} -->